#@bigquery
SELECT age, workclass, occupation, education_num, marital_status, capital_gain, label
FROM `mlops-dev-999-c6b8.earnings_prediction.earnings_raw_data` 
LIMIT 50

In [1]:
# The following two lines are only necessary to run once.
# Comment out otherwise for speed-up.
from google.cloud.bigquery import Client, QueryJobConfig
client = Client()

query = """SELECT age, workclass, occupation, education_num, marital_status, capital_gain, label
FROM `mlops-dev-999-c6b8.earnings_prediction.earnings_raw_data` 
LIMIT 50"""
job = client.query(query)
df = job.to_dataframe()

In [37]:
df['label'][1] == '>50K'

True

In [40]:
df['label'] = [int(1) if x == '>50K' else int(0) for x in df['label']]

In [41]:
df.head()

,age,workclass,occupation,education_num,marital_status,capital_gain,label
0,39,Private,Other-service,5,Married-civ-spouse,3411,0
1,72,Private,Exec-managerial,5,Married-civ-spouse,0,1
2,45,Private,Machine-op-inspct,5,Married-civ-spouse,0,1
3,31,Private,Exec-managerial,5,Married-civ-spouse,0,0
4,55,Private,Tech-support,5,Married-civ-spouse,0,0